InformationRegisters/УсловияКредитныхИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияКредитныхИнструментов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПогашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьВыплатыПроцентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностиВыплатыПроцентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетныйСчетВозвратаДенежныхСредств</Name>
					<Comment>Расчетный счет для возврата суммы депозита и выплаты начисленных процентов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокВозвратаДепозитаПоТребованиюКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Реинвестировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаДействияУсловий</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписиЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриПроведенииДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриОтменеПроведенияДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписиРегистраСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписиСправочников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийВызов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗагрузкеДанныхВАнкету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередЗаписьюРегистраСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписиДвиженийРегистровНакопления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписиДокумента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДепозитныеВклады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДепозитныеВклады</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаНачисленияПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПодтверждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентнаяСтавкаПриДосрочномЗакрытии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_НачальныйНоминал</Name>
					<Comment>Попытка использования в коде приведет к безвременной потере рук</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоВостребования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субординированность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Распоряжение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПлановыеВыплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыВыплатПоДепозитнымВкладам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/УсловияКредитныхИнструментов/Ext/RecordSetModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		КредитныйИнструмент = РаботаСКредитнымиИнструментами.ПолучитьКредитныйИнструмент(ДанныеЗаполнения);
		Если ЗначениеЗаполнено(КредитныйИнструмент) Тогда
			
			ЗаполнилиПоСрезу = Ложь;
			СрезПоследних = РегистрыСведений.УсловияКредитныхИнструментов.СрезПоследних(?(ДанныеЗаполнения.Свойство("Период"), ДанныеЗаполнения.Период, ТекущаяДата()), Новый Структура("КредитныйИнструмент", КредитныйИнструмент));
			СрезПоследних.Сортировать("ДатаНачалаДействияУсловий УБЫВ");
			Для каждого ДанныеСреза ИЗ СрезПоследних Цикл
				
				Если НЕ ДанныеСреза.Действует Тогда
					Продолжить;
				КонецЕсли;
				
				Для Каждого Колонка Из СрезПоследних.Колонки Цикл
					
					Если Колонка.Имя = "КредитныйИнструмент" 
						ИЛИ Колонка.Имя = "Комментарий" 
						ИЛИ Колонка.Имя = "Период" 
						ИЛИ Колонка.Имя = "ДатаНачалаДействияУсловий" Тогда 
						
						Продолжить; 
					КонецЕсли;
					
					Если ДанныеЗаполнения.Свойство(Колонка.Имя) И ЗначениеЗаполнено(ДанныеЗаполнения[Колонка.Имя])	Тогда 
						Продолжить; 
					КонецЕсли;
					
					ДанныеЗаполнения.Вставить(Колонка.Имя, ДанныеСреза[Колонка.Имя]);
					
				КонецЦикла;
				
				ЗаполнилиПоСрезу = Истина;
				Прервать;
			КонецЦикла;
				
			Если ТипЗнч(КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
				ДанныеЗаполнения.Вставить("УчетныйАктив", Справочники.УчетныеАктивыЕПС.ДепозитныеВкладыПоАС);	
				Если НЕ ЗаполнилиПоСрезу  Тогда
					ДанныеЗаполнения.Вставить("Период", КредитныйИнструмент.ДатаРегистрации);
					ДанныеЗаполнения.Вставить("ДатаНачалаДействияУсловий", КредитныйИнструмент.ДатаРегистрации);
				КонецЕсли;
			ИначеЕсли ТипЗнч(КредитныйИнструмент) = Тип("СправочникСсылка.Займы") Тогда
				Если КредитныйИнструмент.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Выданный Тогда
					ДанныеЗаполнения.Вставить("УчетныйАктив", Справочники.УчетныеАктивыЕПС.ПредоставленныеЗаймы);	
				Иначе 
					ДанныеЗаполнения.Вставить("УчетныйАктив", Справочники.УчетныеАктивыЕПС.ПолученныеЗаймы);	
				КонецЕсли;
				Если НЕ ЗаполнилиПоСрезу  Тогда
					ДанныеЗаполнения.Вставить("Период", КредитныйИнструмент.ДатаЗаключения);
					ДанныеЗаполнения.Вставить("ДатаНачалаДействияУсловий", КредитныйИнструмент.ДатаЗаключения);
				КонецЕсли;
			КонецЕсли;

			Если Не ДанныеЗаполнения.Свойство("Организация") Тогда
				ДанныеЗаполнения.Вставить("Организация", КредитныйИнструмент.Организация);	
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;	
	
	Если НЕ ДанныеЗаполнения.Свойство("УчетныйАктив") Тогда
		ДанныеЗаполнения.Вставить("УчетныйАктив", Справочники.УчетныеАктивыЕПС.ДепозитныеВкладыПоАС);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если РаботаСКредитнымиИнструментами.НеобходимоЗаполнениеЗначенияРасчетногоСчетаВозвратаДенежныхСредств(Запись.Организация, Запись.КредитныйИнструмент) Тогда
			
			ПроверяемыеРеквизиты.Добавить("РасчетныйСчетВозвратаДенежныхСредств");			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	УниверсальныеМеханизмы.ЗаполнитьОрганизациюИзВедущегоИзмерения(ЭтотОбъект, "КредитныйИнструмент");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если Справочники.ДепозитныеВклады.БылиДвиженияПоДепозиту(Запись.КредитныйИнструмент, Запись.Организация) Тогда
		
			РеквизитыОповещения = Новый Структура;
			РеквизитыОповещения.Вставить("Организация",						Запись.Организация);
			РеквизитыОповещения.Вставить("Депозит",							Запись.КредитныйИнструмент);
			РеквизитыОповещения.Вставить("ДатаПогашения", 					Запись.ДатаПогашения);
			РеквизитыОповещения.Вставить("Процент",							Запись.Процент);
			РеквизитыОповещения.Вставить("ПериодичностьВыплатыПроцентов",	Запись.ПериодичностьВыплатыПроцентов);
			
			Справочники.Оповещения.СформироватьОповещения("РегистрСведений.УсловияКредитныхИнструментов", Перечисления.ТипыСобытий.ПриЗаписиРегистраСведений, РеквизитыОповещения);
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
